# HasMaterialQuantities Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..HasMaterialQuantities Property
Category Class See Also
---
Identifies if elements of the category are able to report what materials they contain in what quantities.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool HasMaterialQuantities { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasMaterialQuantities As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasMaterialQuantities {
	bool get ();
}
```

# Remarks
Get materials via the Element' property Materials; Get quantities via methods GetMaterialArea and GetMaterialVolume.
# See Also
Category Class
Autodesk.Revit.DB Namespace